# Working with DataFrame

In [1]:
person = {
    "first": "Yoginder",
    "last": "syal",
    "email": "Yogi@gmail.com"
}

In [2]:
person = {
    "first": ["Yoginder"],#this is called lists
    "last": ["syal"],
    "email": ["Yogi@gmail.com"]
}

In [3]:
person = {
    "first": ["Yoginder","Jane", "Hun"],#lists of multiple people
    "last": ["syal", "Blake", "Sui koi"],
    "email": ["Yogi@gmail.com","Blake@gmail.com","Hun@gmail.com"]
}

In [4]:
person["email"]

['Yogi@gmail.com', 'Blake@gmail.com', 'Hun@gmail.com']

In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame(person)

In [7]:
df

      first     last            email
0  Yoginder     syal   Yogi@gmail.com
1      Jane    Blake  Blake@gmail.com
2       Hun  Sui koi    Hun@gmail.com

In [8]:
df["email"]

0     Yogi@gmail.com
1    Blake@gmail.com
2      Hun@gmail.com
Name: email, dtype: object

In [9]:
type(df["email"])

pandas.core.series.Series

In [10]:
df[["email" ,"last"]]

             email     last
0   Yogi@gmail.com     syal
1  Blake@gmail.com    Blake
2    Hun@gmail.com  Sui koi

In [11]:
df.columns #it is used for getting the columns

Index(['first', 'last', 'email'], dtype='object')

### If we want to know the rows , we use iloc=integer location and 0 means the the index of row

In [12]:
df.iloc[0]

first          Yoginder
last               syal
email    Yogi@gmail.com
Name: 0, dtype: object

In [13]:
# if we want the first and the second row, iloc is for integers only
df.iloc[[0, 1]]

      first   last            email
0  Yoginder   syal   Yogi@gmail.com
1      Jane  Blake  Blake@gmail.com

In [14]:
df.iloc[[0, 1], 2]

0     Yogi@gmail.com
1    Blake@gmail.com
Name: email, dtype: object

Difference between iloc and loc

In [15]:
df.loc[0]

first          Yoginder
last               syal
email    Yogi@gmail.com
Name: 0, dtype: object

In [16]:
df.loc[[0, 1], 'email']

0     Yogi@gmail.com
1    Blake@gmail.com
Name: email, dtype: object

In [17]:
df.loc[[0, 1], ['email','last']]

             email   last
0   Yogi@gmail.com   syal
1  Blake@gmail.com  Blake

# Working with Indexes

In [18]:
df["email"]

0     Yogi@gmail.com
1    Blake@gmail.com
2      Hun@gmail.com
Name: email, dtype: object

In [19]:
#df.set_index("email") #setting up the email as index

In [20]:
df #but now we can see that the datadrame is remained unchanged as email is not as index, it has default index as 0,1,2

      first     last            email
0  Yoginder     syal   Yogi@gmail.com
1      Jane    Blake  Blake@gmail.com
2       Hun  Sui koi    Hun@gmail.com

In [21]:
#df.set_index("email", inplace=True) # this inplace=True enables us to change the dataframe permanently

In [22]:
df # here we can see that the email is shows as index adn permanent

      first     last            email
0  Yoginder     syal   Yogi@gmail.com
1      Jane    Blake  Blake@gmail.com
2       Hun  Sui koi    Hun@gmail.com

In [23]:
#df.loc["Yogi@gmail.com"] # now we can see that wirh the help of email we can easily get the person's information

In [24]:
#df.loc["Yogi@gmail.com" , "last"]

In [25]:
df.iloc[0] #if we still want to call it with the default index number then we have to use the iloc
# df.iloc[0], it will give error

first          Yoginder
last               syal
email    Yogi@gmail.com
Name: 0, dtype: object

In [26]:
#df.reset_index(inplace=True) #tis function will reset the dataframe

In [27]:
df #now we can see that the dataframe is reset to its default

      first     last            email
0  Yoginder     syal   Yogi@gmail.com
1      Jane    Blake  Blake@gmail.com
2       Hun  Sui koi    Hun@gmail.com

# FILTERING DATA FROM SERIES OF OBJECTS AND DATAFRAME

In [28]:
df['last'] == 'syal' #it will give us the data having last name =syal, it shows true and false statement

0     True
1    False
2    False
Name: last, dtype: bool

In [29]:
filt = (df['last'] == 'syal')

In [30]:
df[filt]

      first  last           email
0  Yoginder  syal  Yogi@gmail.com

In [31]:
fil = (df['last'] == 'syal') & (df['first'] == 'Yoginder')

In [32]:
df[fil]

      first  last           email
0  Yoginder  syal  Yogi@gmail.com

# MODIFYING AND UPDATE WITHIN DATAFRAME

### UPDATING COLUMNS

In [33]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [34]:
df.columns = ['first name' , 'last name', 'email']

In [35]:
df.columns

Index(['first name', 'last name', 'email'], dtype='object')

In [36]:
#making the columns names in upper case
df.columns = [x.upper() for x in df.columns]
df

  FIRST NAME LAST NAME            EMAIL
0   Yoginder      syal   Yogi@gmail.com
1       Jane     Blake  Blake@gmail.com
2        Hun   Sui koi    Hun@gmail.com

In [37]:
# if we want to remove spaces with underscore
df.columns = df.columns.str.replace(" " , "_")
df

  FIRST_NAME LAST_NAME            EMAIL
0   Yoginder      syal   Yogi@gmail.com
1       Jane     Blake  Blake@gmail.com
2        Hun   Sui koi    Hun@gmail.com

In [38]:
# resetting the dataframe in lower case
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name            email
0   Yoginder      syal   Yogi@gmail.com
1       Jane     Blake  Blake@gmail.com
2        Hun   Sui koi    Hun@gmail.com

In [39]:
# Renaming the particular columns
df.rename(columns={'first_name':'first'})

      first last_name            email
0  Yoginder      syal   Yogi@gmail.com
1      Jane     Blake  Blake@gmail.com
2       Hun   Sui koi    Hun@gmail.com

In [40]:
df

  first_name last_name            email
0   Yoginder      syal   Yogi@gmail.com
1       Jane     Blake  Blake@gmail.com
2        Hun   Sui koi    Hun@gmail.com

In [41]:
#to make it permanent
df.rename(columns={'first_name':'first'}, inplace=True)

In [42]:
df

      first last_name            email
0  Yoginder      syal   Yogi@gmail.com
1      Jane     Blake  Blake@gmail.com
2       Hun   Sui koi    Hun@gmail.com

In [43]:
#now changing the name, we cant use the loc cause the index is email so we will use iloc
df.iloc[2]

first                  Hun
last_name          Sui koi
email        Hun@gmail.com
Name: 2, dtype: object

In [44]:
df.iloc[2] = ['Hun', 'rathore','hunrathore@gmail.com']

In [45]:
df

      first last_name                 email
0  Yoginder      syal        Yogi@gmail.com
1      Jane     Blake       Blake@gmail.com
2       Hun   rathore  hunrathore@gmail.com

In [46]:
# If we want to make the lower case in whole column
df["first"] = df["first"].str.lower()

In [47]:
df

      first last_name                 email
0  yoginder      syal        Yogi@gmail.com
1      jane     Blake       Blake@gmail.com
2       hun   rathore  hunrathore@gmail.com

## Four advance methods to change
1.apply
2.map
3.applymap
4.replace

### 1. USING APPLY ON SERIES OBJECTS

In [48]:
#to know the lenght of data. eg:knowing the length of last_name
df['last_name'].apply(len)

0    4
1    5
2    7
Name: last_name, dtype: int64

In [49]:
# we  can also use this to update the data
def update_email(last_name):
    return last_name.upper()

In [50]:
df['last_name'].apply(update_email)

0       SYAL
1      BLAKE
2    RATHORE
Name: last_name, dtype: object

In [51]:
df['last_name']=df['last_name'].apply(update_email)

In [52]:
df

      first last_name                 email
0  yoginder      SYAL        Yogi@gmail.com
1      jane     BLAKE       Blake@gmail.com
2       hun   RATHORE  hunrathore@gmail.com

In [53]:
#now i want to convert it back to lower case
df['last_name']=df['last_name'].apply(lambda x: x.lower())

In [54]:
df

      first last_name                 email
0  yoginder      syal        Yogi@gmail.com
1      jane     blake       Blake@gmail.com
2       hun   rathore  hunrathore@gmail.com

### 2. USING APPLY OF DATAFRAMES

In [55]:
df['last_name'].apply(len) #IT GIVES THE DETAILS OF SPECIFIC rows IE last_name

0    4
1    5
2    7
Name: last_name, dtype: int64

In [56]:
df.apply(len) # the first rows has 3 values nad last_name has also 3 values

first        3
last_name    3
email        3
dtype: int64

In [57]:
#applying it on columns
df.apply(len,  axis = 'columns')

0    3
1    3
2    3
dtype: int64

### USING APPLYMAP

In [58]:
df.applymap(len)

   first  last_name  email
0      8          4     14
1      4          5     15
2      3          7     20

### USING MAP METHOD (it is used to subsititue values only in  SERIES)

In [59]:
df['first']=df['first'].map({'yoginder': 'chris','jane':'angie'})

In [60]:
df

   first last_name                 email
0  chris      syal        Yogi@gmail.com
1  angie     blake       Blake@gmail.com
2    NaN   rathore  hunrathore@gmail.com

# ADDING AND REMOVING ROWS AND COLUMNS

### Adding columns

In [61]:
#combining the first and last_name columns
df["full_name"]=df['first'] + " " +  df["last_name"]

### Removing columns

In [62]:
df.drop(columns=['first','last_name'])

                  email    full_name
0        Yogi@gmail.com   chris syal
1       Blake@gmail.com  angie blake
2  hunrathore@gmail.com          NaN

In [63]:
df['full_name'].str.split(" ") #split method

0     [chris, syal]
1    [angie, blake]
2               NaN
Name: full_name, dtype: object

In [64]:
df['full_name'].str.split(" ", expand=True)

       0      1
0  chris   syal
1  angie  blake
2    NaN    NaN

In [65]:
df

   first last_name                 email    full_name
0  chris      syal        Yogi@gmail.com   chris syal
1  angie     blake       Blake@gmail.com  angie blake
2    NaN   rathore  hunrathore@gmail.com          NaN

### If we want to add new name called tony

In [66]:
#we will use the append option
#df.append({'first':'Tony'}) #this will show the error as we inserted only name and the other information like email,last_name etc is absent

In [67]:
df.append({'first':'Tony'}, ignore_index=True)

   first last_name                 email    full_name
0  chris      syal        Yogi@gmail.com   chris syal
1  angie     blake       Blake@gmail.com  angie blake
2    NaN   rathore  hunrathore@gmail.com          NaN
3   Tony       NaN                   NaN          NaN

In [68]:
person = {
    "first": ["Tony","Steve"],#lists of multiple people
    "last_name": ["Stark", "Rogers"],
    "email": ["Ironman@gmail.com","Cap@gmail.com"]
}
df2= pd.DataFrame(person)

In [69]:
df2

   first last_name              email
0   Tony     Stark  Ironman@gmail.com
1  Steve    Rogers      Cap@gmail.com

### adding df2 to df

In [70]:
df.append(df2, ignore_index=True)

   first last_name                 email    full_name
0  chris      syal        Yogi@gmail.com   chris syal
1  angie     blake       Blake@gmail.com  angie blake
2    NaN   rathore  hunrathore@gmail.com          NaN
3   Tony     Stark     Ironman@gmail.com          NaN
4  Steve    Rogers         Cap@gmail.com          NaN

In [71]:
df=df.append(df2, ignore_index=True)

In [72]:
df

   first last_name                 email    full_name
0  chris      syal        Yogi@gmail.com   chris syal
1  angie     blake       Blake@gmail.com  angie blake
2    NaN   rathore  hunrathore@gmail.com          NaN
3   Tony     Stark     Ironman@gmail.com          NaN
4  Steve    Rogers         Cap@gmail.com          NaN

## Removing rows

In [73]:
#removing steve roger
df.drop(index=4)

   first last_name                 email    full_name
0  chris      syal        Yogi@gmail.com   chris syal
1  angie     blake       Blake@gmail.com  angie blake
2    NaN   rathore  hunrathore@gmail.com          NaN
3   Tony     Stark     Ironman@gmail.com          NaN

In [74]:
remove = df['last_name'] == 'blake'
df.drop(index=df[remove].index)

   first last_name                 email   full_name
0  chris      syal        Yogi@gmail.com  chris syal
2    NaN   rathore  hunrathore@gmail.com         NaN
3   Tony     Stark     Ironman@gmail.com         NaN
4  Steve    Rogers         Cap@gmail.com         NaN

# SORTING DATA IN PANDAS

In [75]:
df.sort_values(by='last_name',ascending=False)

   first last_name                 email    full_name
0  chris      syal        Yogi@gmail.com   chris syal
2    NaN   rathore  hunrathore@gmail.com          NaN
1  angie     blake       Blake@gmail.com  angie blake
3   Tony     Stark     Ironman@gmail.com          NaN
4  Steve    Rogers         Cap@gmail.com          NaN

# *GROUPING AND AGGREGATING DATA

##### WE WILL BE COMBINING MULTIPLE PIECES OF DATA INTO SINGLE RESULT(EG: MEAN,MEDIAN,Z ARE SOME AGGREGATE FUNCTIONS

# CLEANING DATA

### HOW TO DROP MISSING VALUES

In [87]:
# we have missing data in dataframe
people = {
    "first": ["Yoginder","Jane", "Hun",'Chris',np.nan, None, 'NA'],#lists of multiple people
    "last": ["syal", "Blake", "Sui koi",'Johnson', np.nan, np.nan,'Missing'],
    "email": ["Yogi@gmail.com","Blake@gmail.com","Hun@gmail.com", None, np.nan, 'Anonymous@gmail.com', np.nan],
    "age": ['33','55','63','36', None, None, 'Missing']
}

In [88]:
df = pd.DataFrame(people)

In [89]:
df

      first     last                email      age
0  Yoginder     syal       Yogi@gmail.com       33
1      Jane    Blake      Blake@gmail.com       55
2       Hun  Sui koi        Hun@gmail.com       63
3     Chris  Johnson                 None       36
4       NaN      NaN                  NaN     None
5      None      NaN  Anonymous@gmail.com     None
6        NA  Missing                  NaN  Missing

#### using drop na method

In [90]:
df.dropna()

      first     last            email age
0  Yoginder     syal   Yogi@gmail.com  33
1      Jane    Blake  Blake@gmail.com  55
2       Hun  Sui koi    Hun@gmail.com  63

In [92]:
df.dropna(axis='index', how='all')

      first     last                email      age
0  Yoginder     syal       Yogi@gmail.com       33
1      Jane    Blake      Blake@gmail.com       55
2       Hun  Sui koi        Hun@gmail.com       63
3     Chris  Johnson                 None       36
5      None      NaN  Anonymous@gmail.com     None
6        NA  Missing                  NaN  Missing

In [95]:
df.dropna(axis='columns', how='any') #it will guve the empty dataframe

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [96]:
df.dropna(axis='index', how='all',  subset=['email'])

      first     last                email   age
0  Yoginder     syal       Yogi@gmail.com    33
1      Jane    Blake      Blake@gmail.com    55
2       Hun  Sui koi        Hun@gmail.com    63
5      None      NaN  Anonymous@gmail.com  None

In [97]:
# getting values that have email or a last name
df.dropna(axis='index', how='all', subset=['last','email'])

      first     last                email      age
0  Yoginder     syal       Yogi@gmail.com       33
1      Jane    Blake      Blake@gmail.com       55
2       Hun  Sui koi        Hun@gmail.com       63
3     Chris  Johnson                 None       36
5      None      NaN  Anonymous@gmail.com     None
6        NA  Missing                  NaN  Missing

### Replacing the missing and NA strings with proper numpy nan value

In [98]:
df = pd.DataFrame(people)
df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [99]:
df

      first     last                email   age
0  Yoginder     syal       Yogi@gmail.com    33
1      Jane    Blake      Blake@gmail.com    55
2       Hun  Sui koi        Hun@gmail.com    63
3     Chris  Johnson                 None    36
4       NaN      NaN                  NaN  None
5      None      NaN  Anonymous@gmail.com  None
6       NaN      NaN                  NaN   NaN

In [101]:
## which values are na or not
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

### Putting missing in NaN values

In [103]:
df.fillna('MISSING') #IT IS MOST USEFUL FOR NUMERICAL DATA

      first     last                email      age
0  Yoginder     syal       Yogi@gmail.com       33
1      Jane    Blake      Blake@gmail.com       55
2       Hun  Sui koi        Hun@gmail.com       63
3     Chris  Johnson              MISSING       36
4   MISSING  MISSING              MISSING  MISSING
5   MISSING  MISSING  Anonymous@gmail.com  MISSING
6   MISSING  MISSING              MISSING  MISSING

In [104]:
df.fillna(0) #IT IS MOST USEFUL FOR NUMERICAL DATA

      first     last                email age
0  Yoginder     syal       Yogi@gmail.com  33
1      Jane    Blake      Blake@gmail.com  55
2       Hun  Sui koi        Hun@gmail.com  63
3     Chris  Johnson                    0  36
4         0        0                    0   0
5         0        0  Anonymous@gmail.com   0
6         0        0                    0   0

In [106]:
df.dtypes # the age is not a integer its a string ie object

first    object
last     object
email    object
age      object
dtype: object

In [108]:
# if we want to average age, it will give error
##df['age'].mean()

In [109]:
# we will use float datatype
df['age'] = df['age'].astype(float)

In [111]:
df.dtypes #now we can see age is float

first     object
last      object
email     object
age      float64
dtype: object

In [112]:
df['age'].mean()

46.75